{
	"subject": "Rose",
	"dialogueSegments":
	[
		{
			"text": "Rose! Is that you? I finally opened my own restaurant!",
			"speaker": "Chef",
			"emotion": "happy"
		},
		{
			"text": "That you did little guy. You’re all grown up now. Brewing your first coffee as well I see.",
			"speaker": "Rose",
			"emotion": "smirk"
		},
		{
			"text": "Yeah! Wanna try it? Your restaurant always had the best coffee.",
			"speaker": "Chef",
			"emotion": "sad"
		},
		{	
			"text": "If you insist, little guy. Let’s give this brew a shot.",
			"speaker": "Rose",
			"emotion": "happy"
		},
		{	
			"text": "Chef! What is this? Did you even filter it?! I can still taste the crust!",
			"speaker": "Rose",
			"emotion": "surprised"
		},
		{
			"text": "Is that not how you brew coffee?",
			"speaker": "Chef",
			"emotion": "surprised"
		},
		{	
			"text": "No, Chef. You have to tailor every order to the customer! No two customers are the same, you know.",
			"speaker": "Rose",
			"emotion": "sad"
		},
		{	
			"text": "I see! So I can’t just use the same technique every time?",
			"speaker": "Chef",
			"emotion": "neutral"
		},
		{	
			"text": "That’s right Chef, you’re a quick learner! Now please, go out and try again! I’ll be waiting!",
			"speaker": "Rose",
			"emotion": "happy"
		}
	],
	"bestEnding":
	[
		{
			"text": "Here you go Rose, how I’d do?",
			"speaker": "Chef",
			"emotion": "surprised"
		},
		{
			"text": "Hmmm. Much better than last time Chef! But you’ve got a long way to go! Don’t get lazy.",
			"speaker": "Rose",
			"emotion": "happy"
		},
		{
			"text": "Of course not! This cafe’ll be in tip-top shape next time you’re here.",
			"speaker": "Chef",
			"emotion": "neutral"
		},
		{	
			"text": "Careful Chef, I’m gonna hold you to that standard! I’ve got to get back to work, but I’ll be back!",
			"speaker": "Rose",
			"emotion": "smirk"
		},
		{
			"text": "I’ll see you around Rose. Thanks again!",
			"speaker": "Chef",
			"emotion": "happy"
		}
	],
	"goodEnding":
	[
		{
			"text": "Here you go Rose. How’s this one?",
			"speaker": "Chef",
			"emotion": "neutral"
		},
		{
			"text": "It’s… passable I suppose. If you want the Seventino Midnight Cafe to be bustling with people, you’re gonna have to try a little harder Chef.",
			"speaker": "Rose",
			"emotion": "sad"
		},
		{
			"text": "How do I do that? I’m trying my hardest already!",
			"speaker": "Chef",
			"emotion": "sad"
		},
		{	
			"text": "I know little guy. You gotta make each coffee exactly how the customer likes it! Temper it to their expectations, and they’ll be coming back for more!",
			"speaker": "Rose",
			"emotion": "neutral"
		},
		{	
			"text": "I see. So everyone is going to want their coffee a little differently?",
			"speaker": "Chef",
			"emotion": "neutral"
		},
		{	
			"text": "Exactly! Keep that attitude up and I’m sure you’ll succeed. I’ve got to get back to work at my own restaurant, so I’ll be back later to check on your progress. Cya later Chef!",
			"speaker": "Rose",
			"emotion": "smirk"
		},
		{
			"text": "Bye Rose! Thank you again. Your next coffee will be phenomenal!",
			"speaker": "Chef",
			"emotion": "happy"
		}
	],
	"textureMin": 0,
	"textureMax": 100,
	"warmthMin": 0,
	"warmthMax": 100,
	"flavorMin": 0,
	"flavorMax": 100
}